package com.neusoft.test0713;

public class Htest2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/**
 * 猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个，第二天早上又将剩下的桃子吃掉一半，又多吃了一个。
 * 以后每天早上都吃了前一天剩下的一半零一个。
 * 到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少。（知识点：循环语句 while）
 * 
 * 					1·············1.5          ·                   1.5*1
 * 					2·············1.5 +1.5          ·              1.5*2
 *  				3·············1.5 +1.5 +1.5         ·          1.5*3
 *   				4·············1.5 +1.5 +1.5 +1.5           ·   1.5*4
 *    				5·············1.5 +1.5 +1.5 +1.5 +1.5          1.5*5	
 */
		
		double i=1,j = 0;
		while(i<=10){
			j=1.5*i;
			i++;
		}
		System.out.println(j+1);
	}

}
